In [45]:
# Pandas kütüphanesini içe aktar (veri okuma, temizleme, analiz için)
import pandas as pd

In [ ]:
# Veri setinin dosya adı
file_path = "salaries_by_college_major.csv"

In [47]:
# CSV dosyasını okumayı dene
try:
    df = pd.read_csv(file_path)     # CSV dosyasını okuma
    print("Dosya başarıyla yüklendi:", file_path)
except FileNotFoundError:
    print(f"Dosya bulunamadı: {file_path} — Lütfen dosya yolunu kontrol edin.")

Dosya başarıyla yüklendi: salaries_by_college_major.csv

In [48]:
# Veri setinin başlangıç kısmını göster (kontrol için)
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [61]:
# Kolonlar, veri tipleri, kaç satır olduğu gibi bilgileri gösterir
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Undergraduate Major                50 non-null     object
 1   Starting Median Salary             50 non-null     float64
 2   Mid-Career Median Salary           50 non-null     float64
 3   Mid-Career 10th Percentile Salary  50 non-null     float64
 4   Mid-Career 90th Percentile Salary  50 non-null     float64
 5   Group                              50 non-null     object
dtypes: float64(4), object(2)
memory usage: 4.8+ KB

In [ ]:
# Ortalama, min, max gibi özet istatistikleri gösterme
df.describe()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
count,50.000000,50.00000,50.000000,50.000000
mean,44310.000000,74786.00000,43408.000000,142766.000000
std,9360.866217,16088.40386,12000.779567,27851.249267
min,34000.000000,52000.00000,26700.000000,96400.000000
25%,37050.000000,60825.00000,34825.000000,124250.000000
50%,40850.000000,72000.00000,39400.000000,145500.000000
75%,49875.000000,88750.00000,49850.000000,161750.000000
max,74300.000000,107000.00000,71900.000000,210000.000000

In [62]:
# Hangi kolonlarda kaç tane eksik değer olduğunu gösterir
df.isna().sum()

Undergraduate Major                  0
Starting Median Salary               0
Mid-Career Median Salary             0
Mid-Career 10th Percentile Salary    0
Mid-Career 90th Percentile Salary    0
Group                                0
dtype: int64

In [ ]:
# Eksik değer içeren satırları temizleme
df = df.dropna()

In [64]:
# 'Undergraduate Major' kolonunun ilk 5 değerini göster
df["Undergraduate Major"].head()

0               Accounting
1    Aerospace Engineering
2              Agriculture
3             Anthropology
4             Architecture
Name: Undergraduate Major, dtype: object

In [ ]:
# Birden fazla kolonu görüntüleme
df[["Undergraduate Major", "Starting Median Salary"]].head()

     Undergraduate Major  Starting Median Salary
0             Accounting                 46000.0
1  Aerospace Engineering                 57700.0
2            Agriculture                 42600.0
3           Anthropology                 36800.0
4           Architecture                 41600.0

In [66]:
# 1. satırdaki Mid-Career Median Salary değerini getir
df.loc[1, "Mid-Career Median Salary"]

101000.0

In [67]:
# Starting Median Salary'e göre büyükten küçüğe sıralama
df.sort_values("Starting Median Salary", ascending=False).head(10)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
43,Physician Assistant,74300.0,91700.0,66400.0,124000.0,STEM
8,Chemical Engineering,63200.0,107000.0,71900.0,194000.0,STEM
12,Computer Engineering,61400.0,105000.0,66100.0,162000.0,STEM
19,Electrical Engineering,60900.0,103000.0,69300.0,168000.0,STEM
38,Mechanical Engineering,57900.0,93600.0,63700.0,163000.0,STEM
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
30,Industrial Engineering,57700.0,94700.0,57100.0,173000.0,STEM
13,Computer Science,55900.0,95500.0,56000.0,154000.0,STEM
40,Nursing,54200.0,67000.0,47600.0,98300.0,Business
10,Civil Engineering,53900.0,90500.0,63400.0,148000.0,STEM

In [68]:
# Starting Median Salary'e göre küçükten büyüğe sıralama
df.sort_values("Starting Median Salary").head(10)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
18,Education,34900.0,52000.0,29300.0,102000.0,HASS
15,Criminal Justice,35000.0,56300.0,32200.0,107000.0,HASS
34,Journalism,35600.0,66700.0,38400.0,145000.0,HASS
26,Graphic Design,35700.0,59800.0,36000.0,112000.0,HASS
5,Art History,35800.0,64900.0,28800.0,125000.0,HASS
16,Drama,35900.0,56900.0,36700.0,153000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
39,Music,35900.0,55000.0,26700.0,134000.0,HASS

In [69]:
# Potansiyel = Mid-Career 90th Percentile - Mid-Career 10th Percentile
df["Potential"] = df["Mid-Career 90th Percentile Salary"] - df["Mid-Career 10th Percentile Salary"]

In [70]:
df.nlargest(10, "Potential")

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group,Potential
17,Economics,50100.0,98600.0,50600.0,210000.0,Business,159400.0
22,Finance,47900.0,88300.0,47200.0,195000.0,Business,147800.0
37,Math,45400.0,92400.0,45200.0,183000.0,STEM,137800.0
36,Marketing,40800.0,79600.0,42100.0,175000.0,Business,132900.0
42,Philosophy,39900.0,81200.0,35500.0,168000.0,HASS,132500.0
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS,126800.0
8,Chemical Engineering,63200.0,107000.0,71900.0,194000.0,STEM,122100.0
44,Physics,50300.0,97300.0,56000.0,178000.0,STEM,122000.0
33,International Relations,40900.0,80900.0,38200.0,157000.0,HASS,118800.0
16,Drama,35900.0,56900.0,36700.0,153000.0,HASS,116300.0

In [71]:
# Group (Business, STEM, Humanities vb.) kolonuna göre gruplayıp
# Mid-Career Median Salary ortalamasını alıyoruz
df.groupby("Group")["Mid-Career Median Salary"].mean()

Group
Business    75083.333333
HASS        62968.181818
STEM        90812.500000
Name: Mid-Career Median Salary, dtype: float64

In [72]:
df.pivot_table(
    values="Mid-Career Median Salary",
    index="Group",
    aggfunc="mean"
)

          Mid-Career Median Salary
Group
Business              75083.333333
HASS                  62968.181818
STEM                  90812.500000